AUTO_config_TK_pesok/src/Documents/ПланАктивности/ПланАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланАктивности</name>
  <registerRecords>InformationRegister.ПланАктивности</registerRecords>
  <attributes>
    <name>Активность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>СкладКомпании</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелеваяМарка</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ЦелевыеМарки</types>
        <types>CatalogRef.ТоварныеМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПериода</name>
      <type>
        <types>EnumRef.ВидыПериодаАктивности</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Периоды</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПериода</name>
      <type>
        <types>EnumRef.ВидыПериодаАктивности</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>35</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ЦелеваяМарка</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ЦелевыеМарки</types>
        <types>CatalogRef.ТоварныеМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расчет</name>
    <attributes>
      <name>Порог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Напоказ</name>
    <comment>Служит для визуализации поанов</comment>
    <attributes>
      <name>СкладКомпании</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Куратор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ПланАктивности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область Проведение
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
		
		// Создадим запрос инициализации движений
		
		Запрос = Новый Запрос;
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		// Сформируем текст запроса
		
		ТекстыЗапроса = Новый СписокЗначений;
		ТекстЗапросаТаблицаПланАктивности(Запрос, ТекстыЗапроса, Регистры);
		
		ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
	КонецПроцедуры
	
	Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
	КонецПроцедуры
	
	Функция ТекстЗапросаТаблицаПланАктивности(Запрос, ТекстыЗапроса, Регистры)
		
		ИмяРегистра = "ПланАктивности";
		
		Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
			Возврат "";
		КонецЕсли; 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ПланАктивностиПланы.Ссылка.Дата КАК Период,
		|	ПланАктивностиПланы.СкладКомпании КАК СкладКомпании,
		|	ПланАктивностиПланы.ЦелеваяМарка КАК ЦелеваяМарка,
		|	ПланАктивностиПланы.ВидПериода КАК ВидПериода,
		|	ПланАктивностиПланы.НачалоДействия КАК НачалоДействия,
		|	ПланАктивностиПланы.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ПланАктивностиПланы.Количество КАК Количество
		|ИЗ
		|	Документ.ПланАктивности.Планы КАК ПланАктивностиПланы
		|ГДЕ
		|	ПланАктивностиПланы.Ссылка = &Ссылка";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	
	#КонецОбласти
	
	
	#Область ПрограммныйИнтерфейс	
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		//	Ленточки
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПланАктивности";
		КомандаПечати.Идентификатор = "Ленточки";
		КомандаПечати.Порядок = 1;
		КомандаПечати.Картинка = БиблиотекаКартинок.Отчеты;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Печать ленточек';uk='Друк стрічок'");
		КомандаПечати.Представление = НСтр("ru = 'Ленточки';uk='Стрічки'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		
		//	Премия
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПланАктивности";
		КомандаПечати.Идентификатор = "Премия";
		КомандаПечати.Порядок = 2;
		КомандаПечати.Картинка = БиблиотекаКартинок.РазделФинансы16;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Печать данных по премиям';uk='Друк даних по преміях'");
		КомандаПечати.Представление = НСтр("ru = 'Премия';uk='Премія'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		
		//	Выполнение
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПланАктивности";
		КомандаПечати.Идентификатор = "Выполнение";
		КомандаПечати.Порядок = 3;
		КомандаПечати.Картинка = БиблиотекаКартинок.Сумма;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Печать данных по выполнению плана';uk='Друк даних по виконанню плану'");
		КомандаПечати.Представление = НСтр("ru = 'Выполнение плана';uk='Виконання плану'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		
	КонецПроцедуры
	
	// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
	Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	#КонецОбласти
	
	
	#Область Печать
	
	// Формирует печатные формы.
	//
	// Параметры:
	//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
	//  ПараметрыПечати - Структура - дополнительные настройки печати;
	//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
	//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
	//                                            представление - имя области, в которой был выведен объект (выходной параметр);
	//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ленточки") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Ленточки",
			НСтр("ru = 'Ленточки';uk='Стрічки'"), 
			ПечатьАктивности(МассивОбъектов, ОбъектыПечати, "Ленточки"),
			,
			"Отчеты.ВыполнениеПлановАктивности.Ленточки");		
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Премия") Тогда 		
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Премия",
			НСтр("ru = 'Премия';uk='Премія'"), 
			ПечатьАктивности(МассивОбъектов, ОбъектыПечати, "Премия"),
			,
			"Отчеты.ВыполнениеПлановАктивности.Премия");		
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Выполнение") Тогда 		
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Выполнение",
			НСтр("ru = 'Выполнение плана';uk='Виконання плану'"), 
			ПечатьАктивности(МассивОбъектов, ОбъектыПечати, "Итого"),
			,
			"отчеты.ВыполнениеПлановАктивности.Итого");		
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПечатьАктивности(МассивОбъектов, ОбъектыПечати, Отчет)
		Возврат Отчеты.ВыполнениеПлановАктивности.СформироватьОтчет(МассивОбъектов[0],Отчет);
	КонецФункции
	
	
	#КонецОбласти	
	
	
	#Область СлужебныеПроцедурыИФункции
	
	
	#КонецОбласти	
	
	
	
#КонецЕсли
